tutorials/RAS/2DCylinderGranularFlow/system/funkySetFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
expressions
 (
	//sedimentvelocity
	//{
	//field Ua; //field to initialise
	//fields
	//(
	//z Ua
	//);
	////lookuptables (
	////{
	////name inletprofilesedvel;
	////outOfBounds clamp;
	////file "$FOAM_CASE/1d_profil/Ua0.xy";
	////}
	////{
	////name inletprofilesedvelv;
	////outOfBounds clamp;
	////file "$FOAM_CASE/1d_profil/Ua1.xy";
	////}
	////{
	////name inletprofilesedvelw;
	////outOfBounds clamp;
	////file "$FOAM_CASE/1d_profil/Ua2.xy";
	////}
	////);
        ////value uniform (1 0 0);
	////expression "vector(inletprofilesedvel(pos().y),inletprofilesedvelv(pos().y),0)";
	////keepPatches 1;
        ////}

	//fluidvelocity
	//{
	//field Ub; //field to initialise
	//fields
	//(
	//z Ub
	//);
	//lookuptables (
	//{
	//name inletprofilefvel;
	//outOfBounds clamp;
	//file "$FOAM_CASE/1d_profil/Ub0.xy";
	//}
	//{
	//name inletprofilefvelv;
	//outOfBounds clamp;
	//file "$FOAM_CASE/1d_profil/Ub1.xy";
	//}
	//{
	//name inletprofilefvelw;
	//outOfBounds clamp;
	//file "$FOAM_CASE/1d_profil/Ub2.xy";
	//}
	//);
        //value uniform (1 0 0);
       	//expression "vector(inletprofilefvel(pos().y), inletprofilefvelv(pos().y), 0)";
	//keepPatches 1;
        //}

       alpha
        {
        field alpha.a; //field to initialise
        fields
        (
        z alpha
        );
        lookuptables (
        {
        name inletprofilealpha;
        outOfBounds clamp;
        file "$FOAM_CASE/1d_profil/alpha.aNew.xy";
        }
        );
        expression "inletprofilealpha(pos().y+0.0443)";
        keepPatches 1;
        }


 );
